eisup_2019_docmng_integration/src/BusinessProcesses/абс_СогласованиеДоговоровПодряда/абс_СогласованиеДоговоровПодряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абс_СогласованиеДоговоровПодряда</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>ДоговорПодряда</name>
    <type>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыДоговоровПодряда/абс_СтатусыДоговоровПодряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыДоговоровПодряда</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеВторойСтороны</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителяЦФО</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЭБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеГлавнымБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеКадрами</name>
  </enumValues>
  <enumValues>
    <name>Подписание</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияСотрудника</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияНомераДоговора</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаПД</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеОтделомКадров</name>
  </enumValues>
  <enumValues>
    <name>СменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ДоговорНаВыполнениеРаботСФизЛицом/ДоговорНаВыполнениеРаботСФизЛицом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорНаВыполнениеРаботСФизЛицом</name>
  <comment>(Регл)</comment>
  <basedOn>Catalog.СотрудникиОрганизаций</basedOn>
  <registerRecords>InformationRegister.РеглУчетПлановыхНачисленийРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаРаботу</name>
    <comment>Сумма в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровСФизЛицами</types>
      <types>EnumRef.ВидыДоговоровГПХСФизЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвторскогоДоговора</name>
    <type>
      <types>EnumRef.ВидыАвторскогоДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерОплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыПоДоговору</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтнесениеРасходовКДеятельностиЕНВД</name>
    <type>
      <types>EnumRef.ОтнесениеРасходовКДеятельностиЕНВД</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВычета</name>
    <type>
      <types>CatalogRef.ВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусДоговора</name>
    <type>
      <types>EnumRef.абс_СтатусыДоговоровПодряда</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусИСУЗК</name>
    <type>
      <types>EnumRef.абс_СтатусыКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПаспортныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресПоПрописке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресМестаЖительства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресПропискиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресПроживанияПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВНДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ГруппаСпособовОтражения</name>
    <type>
      <types>CatalogRef.ttk_ГруппыСпособовОтражения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_ГрафикРабот</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/BusinessProcesses/абс_СогласованиеДоговоровПодряда/ObjectModule.bsl
Перем ФормаДоговора Экспорт;

/////////////////////////////////////////////////
// Процедуры обработки ИнтерактивнойАктивации

Процедура ЗаполнениеДоговораПодрядаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абсСогласованиеДоговоровПодряда.ТочкиМаршрута.ЗаполнениеДоговораПодряда Тогда
		Если ДоговорПодряда.Пустая() Тогда
			
			ДоговорОбъект = Документы.ДоговорНаВыполнениеРаботСФизЛицом.СоздатьДокумент();
			ФормаДоговора = ДоговорОбъект.ПолучитьФорму("ФормаДокумента");
			ФормаДоговора.Открыть();
			
		Иначе		
			 ОткрытьФормуДоговора(ДоговорПодряда,Задача);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаНСИОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеДействиеСогласованиеРукДепОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);
	
КонецПроцедуры

Процедура ДействиеСогласованиеБухгалтеромОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура СогласованиеПДОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);
	
КонецПроцедуры

Процедура РегистрацияДоговораОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеСогласованиеПВПОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеОтказОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеСогласованиеОтделомКадровОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ОткрытьФормуДоговора(ДоговорПодряда,Задача) Экспорт
	
	Если НЕ ДоговорПодряда.Пустая() Тогда
		
		ФормаДоговора = ДоговорПодряда.ПолучитьФорму("ФормаДокумента");
		
		Если ФормаДоговора.Открыта() Тогда
			ФормаДоговора.Активизировать();
		Иначе
			ФормаДоговора.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////
//Обработчики ПриСозданииЗадач

Процедура СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ФормируемыеЗадачи.Очистить();	
	
	абс_БизнесПроцессы.СформироватьЗадачуСогласованиеДоговораПодряда(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, ДоговорПодряда.Ответственный, Отказ,,,Неопределено);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ЗаполнениеДоговораПодрядаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);

КонецПроцедуры

Процедура ПроверкаНСИПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	//СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	//абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура ДействиеДействиеСогласованиеРукДепПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура СогласованиеПДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);	
	
КонецПроцедуры

Процедура ДействиеСогласованиеБухгалтеромПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура РегистрацияДоговораПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ДействиеСогласованиеОтделомКадровПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	//ФормируемыеЗадачи.Очистить();
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);	
	
КонецПроцедуры

Процедура ДействиеСогласованиеПВППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	//СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	//БизнесПроцессы.СформироватьЗадачуСогласованиеДоговораПодряда(Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Ссылка.ДоговорПодряда.Ответственный, Отказ);
	СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ = Ложь)
	
	ФормируемыеЗадачи.Очистить();
	
	абс_БизнесПроцессы.СформироватьЗадачуИсполнителямДоговорыПодряда(ЭтотОбъект.Ссылка, ТочкаМаршрута, ФормируемыеЗадачи);
	
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач. На найдено ответственных для выполнения задачи " + ТочкаМаршрута.НаименованиеЗадачи, Отказ);
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

/////////////////////////////////////////////////
//Обработчики проверки вариантов и условий

Процедура УсловиеОтправитьНаСогласованиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ДоговорПодряда.абс_СтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.ПодписаниеВторойСтороны;
	
КонецПроцедуры

Процедура ВыборВариантаНСИОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.СогласованиеРуководителяЦФО Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеРукЦФО;
	КонецЕсли;

КонецПроцедуры

Процедура ВыборВариантаРукДепОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.ПроверкаЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПроверкаДоговораЭБ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаПДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.СогласованиеГлавнымБухгалтером Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеГлавнымБухгалтером;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаПослеСогласованияБухгалтериейОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора; 
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.СогласованиеКадрами Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеОтделомКадров;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;	
	
КонецПроцедуры   

Процедура ВыборВариантаКадрыОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.ПроверкаПД Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПроверкаПД;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура УсловиеСогласованПВППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	//Результат = ДоговорПодряда.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоровПодряда.Регистрация;
	
КонецПроцедуры

Процедура ЗавершениеДоговорСогласованИЗарегестрированПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ОбъектДП = ДоговорПодряда.ПолучитьОбъект();
	ОбъектДП.абс_СтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Исполнение;
	Попытка
		ОбъектДП.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить("Не удалось завершить согласование договора подряда №"+ОбъектДП.Номер);
	КонецПопытки;
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	
КонецПроцедуры

Процедура ОтменаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	//ОбъектДП = ДоговорПодряда.ПолучитьОбъект();
	//ОбъектДП.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоровПодряда.Отмена;
	////ОбъектДП.ПометкаУдаления = Истина;
	//Попытка
	//	ОбъектДП.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//Исключение
	//	Сообщить("Не удалось отменить проведение договора подряда №"+ОбъектДП.Номер);
	//	Попытка
	//		ОбъектДП.Записать();
	//	Исключение
	//		Сообщить("Не удалось записать договор подряда №"+ОбъектДП.Номер);
	//	КонецПопытки;
	//КонецПопытки;
	//
	//абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ДоговорПодряда.абс_СтатусДоговора);
	//
КонецПроцедуры

/////////////////////////////////////////////////
//Обработчики событий

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Организация = ДоговорПодряда.Организация;
		ПользовательИнициаторБП = ДоговорПодряда.Ответственный;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыборВариантаДоговорПодписанОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.РегистрацияСотрудника Тогда
		Результат = ТочкаВыбораВарианта.Варианты.РегистрацияСотрудника;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	

КонецПроцедуры

Процедура ДействиеРегистрацияСотрудникаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеРегистрацияСотрудникаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	//ФормируемыеЗадачи.Очистить();

	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура ВыборВариантаРегистрацияСотрудникаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.РегистрацияНомераДоговора Тогда
		Результат = ТочкаВыбораВарианта.Варианты.РегистрацияНомераДоговора;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	

КонецПроцедуры

Процедура ДействиеРегистрацияНомераДоговораОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеРегистрацияНомераДоговораПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	//ФормируемыеЗадачи.Очистить();

	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
КонецПроцедуры

Процедура ВыборВариантаНомерЗарегистрированОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Исполнение Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Исполнение;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	

КонецПроцедуры

Процедура ВыборВариантаДоговорОтправленНаСогласованиеОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.ПодписаниеВторойСтороны Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ПодписаниеВторойСтороны;
	КонецЕсли;	

КонецПроцедуры

Процедура ДействиеПроверкаПДОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеПроверкаПДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
КонецПроцедуры

Процедура ВыборВариантаПроверкаПДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Подписание Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Подписание;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	

КонецПроцедуры

Процедура ДействиеИсполнениеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеИсполнениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	//СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	//БизнесПроцессы.СформироватьЗадачуСогласованиеДоговораПодряда(Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Ссылка.ДоговорПодряда.Ответственный, Отказ);
    СформироватьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);

КонецПроцедуры

Процедура ВыборВарианта1ОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.ЗакрытиеОтделомКадров Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ДоговорЗакрытБухгалтерией;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Подписание Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДействиеЗакрытиеОтделомКадровОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеЗакрытиеОтделомКадровПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	//ФормируемыеЗадачи.Очистить();
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);

КонецПроцедуры

Процедура ВыборВариантаДоговорЗакрытОКОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Закрыт Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Закрыт;
	ИначеЕсли ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.Подписание Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;		
	КонецЕсли;	

КонецПроцедуры

Процедура ВыборВариантаЗавершилосьИсполнениеОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусДоговора = ДоговорПодряда.абс_СтатусДоговора;
	
	Если ТекСтатусДоговора = Перечисления.абс_СтатусыДоговоровПодряда.ЗакрытиеБухгалтерией Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ЗакрытиеБухгалтерией;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДействиеЗакрытиеБухгалтериейОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ОткрытьФормуДоговора(ДоговорПодряда,Задача);

КонецПроцедуры

Процедура ДействиеЗакрытиеБухгалтериейПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	//ФормируемыеЗадачи.Очистить();
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
КонецПроцедуры
